Revit 2027 API
MacroManager.GetMacroManagerIterator Method
 Returns a Macro manager iterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroManagerIterator GetMacroManagerIterator()
Public Function GetMacroManagerIterator As MacroManagerIterator
public:
MacroManagerIterator^ GetMacroManagerIterator()
member GetMacroManagerIterator : unit -> MacroManagerIterator
Return Value
MacroManagerIterator
 A Macro manager iterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace